sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : hidkbdservice.c
 * Author             : WCH
 * Version            : V1.0
 * Date               : 2018/12/10
 * Description        : 键盘服务
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for 
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/

/*********************************************************************
 * INCLUDES
 */
#include "CONFIG.h"
#include "hidkbdservice.h"
#include "hiddev.h"
#include "battservice.h"
#include "kb904/config_product.h"
#include "CH585SFR.h"
#include "touchpad.h"
/*********************************************************************
 * MACROS
 */
#define USE_SYS_CTR_HID 1
/*********************************************************************
 * CONSTANTS
 */

/*********************************************************************
 * TYPEDEFS
 */

/*********************************************************************
 * GLOBAL VARIABLES
 */
// HID service UUID
const uint8_t hidServUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(HID_SERV_UUID), HI_UINT16(HID_SERV_UUID)};

// HID Boot Keyboard Input Report characteristic
const uint8_t hidBootKeyInputUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(BOOT_KEY_INPUT_UUID), HI_UINT16(BOOT_KEY_INPUT_UUID)};

// HID Boot Keyboard Output Report characteristic
const uint8_t hidBootKeyOutputUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(BOOT_KEY_OUTPUT_UUID), HI_UINT16(BOOT_KEY_OUTPUT_UUID)};

// HID Information characteristic
const uint8_t hidInfoUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(HID_INFORMATION_UUID), HI_UINT16(HID_INFORMATION_UUID)};

// HID Report Map characteristic
const uint8_t hidReportMapUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(REPORT_MAP_UUID), HI_UINT16(REPORT_MAP_UUID)};

// HID Control Point characteristic
const uint8_t hidControlPointUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(HID_CTRL_PT_UUID), HI_UINT16(HID_CTRL_PT_UUID)};

// HID Report characteristic，所有报告，键盘，鼠标，触摸板都使用这个
const uint8_t hidReportUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(REPORT_UUID), HI_UINT16(REPORT_UUID)};

// HID Protocol Mode characteristic
const uint8_t hidProtocolModeUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(PROTOCOL_MODE_UUID), HI_UINT16(PROTOCOL_MODE_UUID)};

/*********************************************************************
 * EXTERNAL VARIABLES
 */

/*********************************************************************
 * EXTERNAL FUNCTIONS
 */

/*********************************************************************
 * LOCAL VARIABLES
 */

// HID Information characteristic value
static const uint8_t hidInfo[HID_INFORMATION_LEN] = {
    LO_UINT16(0x0111), HI_UINT16(0x0111), // bcdHID (USB HID version)
    HID_COUNTRY_CODE,                     // bCountryCode（编译时配置）
    HID_FEATURE_FLAGS                     // Flags
};
#define APPLE   0
//#define ENABLE_MAC_FN_REPORT   1
#define MOUSE   1
//#define SMART_WHEEL   1
#define TOUCH    1

/************************** IOS begin *********************************/
// 物理尺寸.3*100.4mm
// x y 轴物理最大值
#define IOS_HID_TOUCHPAD_MAX_PHYSICAL_X  1016//1610//1173 // 显示值  设备代表值的边界
#define IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y  555//822//600 
// 逻辑最大值
#define IOS_HID_TOUCHPAD_MAX_LOGICAL_X 	(1728-1)//2729//1990//0x578  // 实际值 1293   测量值 读数 设备返回数值的边界
#define IOS_HID_TOUCHPAD_MAX_LOGICAL_Y  (944-1)//1394//1017//0x320  // 800

#define FINGER_IOS(FINGER_NUMBER) \
	0x05, 0x0D , /*  USAGE PAGE (Digitizer Device Page)  */ \
	0x09, 0x22 , /*  USAGE (Finger)  */ \
	0xA1, 0x00 , /*  COLLECTION (PHYSICAL)  */ \
		0x25, 0x01 , /*  LOGICAL MAXIMUM (1)  */ \
		0x09, 0x42 , /*  USAGE (Tip Switch)  */ \
		0x09, 0x47 , /*  USAGE (Confidence)  */ \
		0x75, 0x01 , /*  REPORT SIZE (1)  */ \
		0x95, 0x02 , /*  REPORT COUNT (2)  */ \
		0x81, 0x02 , /*  INPUT (Data,Var,Abs)  */ \
		0x09, 0x38 , /*  USAGE (Transducer Index)  */ \
		0x25, 0x05 , /*  LOGICAL MAXIMUM (5)  */ \
		0x75, 0x06 , /*  REPORT SIZE (6)  */ \
		0x95, 0x01 , /*  REPORT COUNT (1)  */ \
		0x81, 0x02 , /*  INPUT (Data,Var,Abs)  */ \
		0x05, 0x01 , /*  USAGE PAGE (Generic Desktop Page)  */ \
		0x35, 0x00,/* PHYSICAL_MINIMUM (0) */ \
		0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X & 0xff, \
			IOS_HID_TOUCHPAD_MAX_PHYSICAL_X >> 8, /*  PHYSICAL MAXIMUM (921)  */ \
		0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_X & 0xff, \
			IOS_HID_TOUCHPAD_MAX_LOGICAL_X >> 8, /*  LOGICAL MAXIMUM (1105)  */ \
		0x15, 0x00,/* LOGICAL_MINIMUM (0)*/ \
		0x75, 0x0c, /*  REPORT SIZE (12)  */ \
		0x55, 0x0e,/* UNIT_EXPONENT (-2) */ \
		0x65, 0x11,/* UNIT(SI Length (cm)) 单位*/ \
		0x09, 0x30 , /*  USAGE (X)  */ \
		0x81, 0x02 , /*  INPUT (Data,Var,Abs)  */ \
		0x35, 0x00,/* PHYSICAL_MINIMUM (0) */ \
		0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y & 0xff, \
			IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y >> 8, /*  PHYSICAL MAXIMUM (506)  */ \
		0x15, 0x00,/* LOGICAL_MINIMUM (0)*/ \
		0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y & 0xff, \
			IOS_HID_TOUCHPAD_MAX_LOGICAL_Y >> 8, /*  LOGICAL MAXIMUM (607)  */ \
		0x09, 0x31 , /*  USAGE (Y)  */ \
		0x81, 0x02 , /*  INPUT (Data,Var,Abs)  */ \
		0x45, 0x00, /* Physical Maximum: 0 */ \
		0x55, 0x00, /* Unit exponent: 0 */ \
		0x65, 0x00, /* Unit: None */ \
	0xC0,  /*  END COLLECTION (Physical)  */

// HID Report Map characteristic value
static const uint8_t hidReportMap[] = {

        0x05, 0x01,     // Usage Pg (Generic Desktop)
        0x09, 0x06,     // Usage (Keyboard)
        0xA1, 0x01,     // Collection: (Application)
        0x85, HID_RPT_ID_CLASS_KEY_IN,     //   ReportID(1)
                        //
        0x05, 0x07,     // Usage Pg (Key Codes)
        0x19, 0xE0,     // Usage Min (224)
        0x29, 0xE7,     // Usage Max (231)
        0x15, 0x00,     // Log Min (0)
        0x25, 0x01,     // Log Max (1)
                        //
                        // Modifier byte
        0x75, 0x01,     // Report Size (1)
        0x95, 0x08,     // Report Count (8)
        0x81, 0x02,     // Input: (Data, Variable, Absolute)
                        //
                        // Reserved byte
        0x95, 0x01,     // Report Count (1)
        0x75, 0x08,     // Report Size (8)
        0x81, 0x01,     // Input: (Constant)
                        //
                        // LED report
        0x95, 0x05,     // Report Count (5)
        0x75, 0x01,     // Report Size (1)
        0x05, 0x08,     // Usage Pg (LEDs)
        0x19, 0x01,     // Usage Min (1)
        0x29, 0x05,     // Usage Max (5)
        0x91, 0x02,     // Output: (Data, Variable, Absolute)
                        //
                        // LED report padding
        0x95, 0x01,     // Report Count (1)
        0x75, 0x03,     // Report Size (3)
        0x91, 0x01,     // Output: (Constant)
                        //
                        // Key arrays (6 bytes)
        0x95, 0x06,     // Report Count (6)
        0x75, 0x08,     // Report Size (8)
        0x15, 0x00,     // Log Min (0)
        0x25, 0x65,     // Log Max (101)
        0x05, 0x07,     // Usage Pg (Key Codes)
        0x19, 0x00,     // Usage Min (0)
        0x29, 0x65,     // Usage Max (101)
        0x81, 0x00,     // Input: (Data, Array)
                        //
        0xC0 ,           // End Collection
#if USE_SYS_CTR_HID
    0x05,0x01,                  //25    GLOBAL_USAGE_PAGE(Generic Desktop Controls)
    0x09,0x80,                  //27    LOCAL_USAGE(SYS_CTL)
    0xA1,0x01,                  //29    MAIN_COLLECTION(Applicatior)
        0x85,HID_RPT_ID_SYS_CTL_IN,                  //31    GLOBAL_REPORT_ID(2)
        0x05,0x01,                  //33    GLOBAL_USAGE_PAGE(Generic Desktop Controls)
        0x19,0x81,                  //35    LOCAL_USAGE_MINIMUM(129)
        0x29,0x83,                  //37    LOCAL_USAGE_MAXIMUM(131)
        0x15,0x00,                  //39    GLOBAL_LOGICAL_MINIMUM(0)
        0x25,0x01,                  //41    GLOBAL_LOCAL_MAXIMUM(1)
        0x95,0x03,                  //43    GLOBAL_REPORT_COUNT(3)
        0x75,0x01,                  //45    GLOBAL_REPORT_SIZE(1)
        0x81,0x02,                  //47    MAIN_INPUT(data var absolute NoWrap linear PreferredState NoNullPosition NonVolatile )  Input 2.3
        0x95,0x01,                  //49    GLOBAL_REPORT_COUNT(1)
        0x75,0x05,                  //51    GLOBAL_REPORT_SIZE(5)
        0x81,0x01,                  //53    MAIN_INPUT(const array absolute NoWrap linear PreferredState NoNullPosition NonVolatile )   Input 3.0
    0xC0,                       //55    MAIN_COLLECTION_END

//    //system control
//    0x05, 0x01,
//    0x09, 0x80,
//    0xA1, 0x01,
//    0x85, HID_RPT_ID_SYS_CTL_IN,  //report ID (2)
//    0x75, 0x02,
//    0x95, 0x01,
//    0x15, 0x01,
//    0x25, 0x03,
//    0x09, 0x82, //count 3
//    0x09, 0x81,
//    0x09, 0x83,
//    0x81, 0x60,
//    0x75, 0x06,
//    0x81, 0x03,
//    0xc0,

//    0x05, 0x01,        // Usage Page (Generic Desktop Ctrls)
//    0x09, 0x80,        // Usage (Sys Control)
//    0xA1, 0x01,        // Collection (Application)
//    0x85, HID_RPT_ID_SYS_CTL_IN,        //   Report ID (2)
//    0x75, 0x01,        //   Report Size (1)
//    0x95, 0x08,        //   Report Count (8)
//    0x15, 0x00,        //   Logical Minimum (0)
//    0x25, 0x01,        //   Logical Maximum (1)
//    0x09, 0x81,        //   Usage (Sys Power Down)
//    0x09, 0x82,        //   Usage (Sys Sleep)
//    0x09, 0x83,        //   Usage (Sys Wake Up)
//    0x81, 0x06,        //   Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
//    0xC0,              // End Collection
#if MOUSE
    0x05, 0x01,        // Usage Page (Generic Desktop Ctrls)
    0x09, 0x02,        // Usage (Mouse)
    0xA1, 0x01,        // Collection (Application)
    0x85, HID_RPT_ID_MOUSE_IN, //   Report ID (4)
    0x09, 0x01,        //   Usage (Pointer)
    0xA1, 0x00,        //   Collection (Physical)
    0x05, 0x09,        //     Usage Page (Button)
    0x19, 0x01,        //     Usage Minimum (0x01)
    0x29, 0x05,        //     Usage Maximum (0x05)
    0x15, 0x00,        //     Logical Minimum (0)
    0x25, 0x01,        //     Logical Maximum (1)
    0x75, 0x01,        //     Report Size (1)
    0x95, 0x05,        //     Report Count (5)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x75, 0x03,        //     Report Size (3)
    0x95, 0x01,        //     Report Count (1)
    0x81, 0x01,        //     Input (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x01,        //     Usage Page (Generic Desktop Ctrls)
    0x09, 0x30,        //     Usage (X)
    0x09, 0x31,        //     Usage (Y)
    0x09, 0x38,        //     Usage (Wheel)
    0x15, 0x81,        //     Logical Minimum (-127)
    0x25, 0x7F,        //     Logical Maximum (127)
    0x75, 0x08,        //     Report Size (8)
    0x95, 0x03,        //     Report Count (3)
    0x81, 0x06,        //     Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x0C,        //     Usage Page (Consumer)
    0x0A, 0x38, 0x02,  //     Usage (AC Pan)
    0x95, 0x01,        //     Report Count (1)
    0x81, 0x06,        //     Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
    0xC0,              //   End Collection
    0xC0,              // End Collection
#endif
#if TOUCH
    0x05, 0x0D,        // Usage Page (Digitizer)
    0x09, 0x05,        // Usage (Touch Pad)
    0xA1, 0x01,        // Collection (Application)
    0x85, 0x03,        //   Report ID (2)
    0x27, 0xFF, 0xFF, 0x00, 0x00,  //   Logical Maximum (65534)
    0x09, 0x56,        //   Usage (0x56)
    0x75, 0x10,        //   Report Size (16)
    0x95, 0x01,        //   Report Count (1)
    0x81, 0x02,        //   Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x25, 0x01,        //   Logical Maximum (1)
    0x75, 0x01,        //   Report Size (1)
    0x09, 0x57,        //   Usage (0x57)
    0xB1, 0x02,        //   Feature (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
    0x26, 0xFF, 0x7F,  //   Logical Maximum (32767)
    0x75, 0x0F,        //   Report Size (15)
    0x09, 0xA1,        //   Usage (0xA1)
    0xB1, 0x02,        //   Feature (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
    0x05, 0x09,        //   Usage Page (Button)
    0x25, 0x01,        //   Logical Maximum (1)
    0x19, 0x01,        //   Usage Minimum (0x01)
    0x29, 0x02,        //   Usage Maximum (0x02)
    0x95, 0x02,        //   Report Count (2)
    0x75, 0x01,        //   Report Size (1)
    0x81, 0x02,        //   Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x95, 0x06,        //   Report Count (6)
    0x81, 0x01,        //   Input (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x0D,        //   Usage Page (Digitizer)
    0x09, 0x22,        //   Usage (Finger)
    0xA1, 0x00,        //   Collection (Physical)
    0x09, 0x42,        //     Usage (Tip Switch)
    0x09, 0x47,        //     Usage (0x47)
    0x95, 0x02,        //     Report Count (2)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x25, 0x04,        //     Logical Maximum (4)
    0x09, 0x38,        //     Usage (Transducer Index)
    0x75, 0x06,        //     Report Size (6)
    0x95, 0x01,        //     Report Count (1)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x01,        //     Usage Page (Generic Desktop Ctrls)
    0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X & 0xff, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X >> 8,//     Physical Maximum (1016)
    0x35, 0x00,        //     Physical Minimum (0)
    0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_X & 0xff, IOS_HID_TOUCHPAD_MAX_LOGICAL_X >> 8,//     Logical Maximum (1727)
    0x75, 0x0C,        //     Report Size (12)
    0x55, 0x0E,        //     Unit Exponent (-2)
    0x65, 0x11,        //     Unit (System: SI Linear, Length: Centimeter)
    0x09, 0x30,        //     Usage (X)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y & 0xff, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y >> 8, //     Physical Maximum (555)
    0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y & 0xff, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y >> 8,//     Logical Maximum (943)
    0x09, 0x31,        //     Usage (Y)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0xC0,              //   End Collection
    0x05, 0x0D,        //   Usage Page (Digitizer)
    0x09, 0x22,        //   Usage (Finger)
    0xA1, 0x00,        //   Collection (Physical)
    0x25, 0x01,        //     Logical Maximum (1)
    0x09, 0x42,        //     Usage (Tip Switch)
    0x09, 0x47,        //     Usage (0x47)
    0x75, 0x01,        //     Report Size (1)
    0x95, 0x02,        //     Report Count (2)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x09, 0x38,        //     Usage (Transducer Index)
    0x25, 0x04,        //     Logical Maximum (4)
    0x75, 0x06,        //     Report Size (6)
    0x95, 0x01,        //     Report Count (1)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x01,        //     Usage Page (Generic Desktop Ctrls)
    0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X & 0xff, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X >> 8,//     Physical Maximum (1016)
    0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_X & 0xff, IOS_HID_TOUCHPAD_MAX_LOGICAL_X >> 8,//     Logical Maximum (1727)
    0x75, 0x0C,        //     Report Size (12)
    0x09, 0x30,        //     Usage (X)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y & 0xff, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y >> 8, //     Physical Maximum (555)
    0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y & 0xff, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y >> 8,//     Logical Maximum (943)
    0x09, 0x31,        //     Usage (Y)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0xC0,              //   End Collection
    0x05, 0x0D,        //   Usage Page (Digitizer)
    0x09, 0x22,        //   Usage (Finger)
    0xA1, 0x00,        //   Collection (Physical)
    0x25, 0x01,        //     Logical Maximum (1)
    0x09, 0x42,        //     Usage (Tip Switch)
    0x09, 0x47,        //     Usage (0x47)
    0x75, 0x01,        //     Report Size (1)
    0x95, 0x02,        //     Report Count (2)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x09, 0x38,        //     Usage (Transducer Index)
    0x25, 0x04,        //     Logical Maximum (4)
    0x75, 0x06,        //     Report Size (6)
    0x95, 0x01,        //     Report Count (1)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x01,        //     Usage Page (Generic Desktop Ctrls)
    0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X & 0xff, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X >> 8,//     Physical Maximum (1016)
    0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_X & 0xff, IOS_HID_TOUCHPAD_MAX_LOGICAL_X >> 8,//     Logical Maximum (1727)
    0x75, 0x0C,        //     Report Size (12)
    0x09, 0x30,        //     Usage (X)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y & 0xff, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y >> 8, //     Physical Maximum (555)
    0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y & 0xff, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y >> 8,//     Logical Maximum (943)
    0x09, 0x31,        //     Usage (Y)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0xC0,              //   End Collection
    0x05, 0x0D,        //   Usage Page (Digitizer)
    0x09, 0x22,        //   Usage (Finger)
    0xA1, 0x00,        //   Collection (Physical)
    0x25, 0x01,        //     Logical Maximum (1)
    0x09, 0x42,        //     Usage (Tip Switch)
    0x09, 0x47,        //     Usage (0x47)
    0x75, 0x01,        //     Report Size (1)
    0x95, 0x02,        //     Report Count (2)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x09, 0x38,        //     Usage (Transducer Index)
    0x25, 0x04,        //     Logical Maximum (4)
    0x75, 0x06,        //     Report Size (6)
    0x95, 0x01,        //     Report Count (1)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x01,        //     Usage Page (Generic Desktop Ctrls)
    0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X & 0xff, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X >> 8,//     Physical Maximum (1016)
    0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_X & 0xff, IOS_HID_TOUCHPAD_MAX_LOGICAL_X >> 8,//     Logical Maximum (1727)
    0x75, 0x0C,        //     Report Size (12)
    0x09, 0x30,        //     Usage (X)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y & 0xff, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y >> 8, //     Physical Maximum (555)
    0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y & 0xff, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y >> 8,//     Logical Maximum (943)
    0x09, 0x31,        //     Usage (Y)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0xC0,              //   End Collection
    0xC0,              // End Collection
#endif
    0x05,0x0C,                  //0     GLOBAL_USAGE_PAGE(Consumer)
    0x09,0x01,                  //2     LOCAL_USAGE(    Consumer Control    )
    0xA1,0x01,                  //4     MAIN_COLLECTION(Applicatior)
        0x85,HID_RPT_ID_CONSUMER_IN,                  //6     GLOBAL_REPORT_ID(3)
        0x19,0x00,                  //8     LOCAL_USAGE_MINIMUM(0)
        0x2A,0x3C,0x03,             //10    LOCAL_USAGE_MAXIMUM(828)
        0x15,0x00,                  //13    GLOBAL_LOGICAL_MINIMUM(0)
        0x26,0x3C,0x03,             //15    GLOBAL_LOCAL_MAXIMUM(828)
        0x95,0x01,                  //18    GLOBAL_REPORT_COUNT(1)
        0x75,0x10,                  //20    GLOBAL_REPORT_SIZE(16)
        0x81,0x00,                  //22    MAIN_INPUT(data array absolute NoWrap linear PreferredState NoNullPosition NonVolatile )    Input 2.0
    0xC0,                       //24    MAIN_COLLECTION_END

    0x05,0x01,                  //0     GLOBAL_USAGE_PAGE(Generic Desktop Controls)
    0x09,0x06,                  //2     LOCAL_USAGE(Keyboard)
    0xA1,0x01,                  //4     MAIN_COLLECTION(Applicatior)
    0x85,HID_RPT_ID_ALL_KEY_IN,                  //6     GLOBAL_REPORT_ID(2)
    0x05,0x07,                  //8     GLOBAL_USAGE_PAGE(Keyboard/Keypad)
    0x19,0x04,                  //10    LOCAL_USAGE_MINIMUM(4)
    0x29,0x70,                  //12    LOCAL_USAGE_MAXIMUM(112)
    0x15,0x00,                  //14    GLOBAL_LOGICAL_MINIMUM(0)
    0x25,0x01,                  //16    GLOBAL_LOCAL_MAXIMUM(1)
    0x75,0x01,                  //18    GLOBAL_REPORT_SIZE(1)
    0x95,0x78,                  //20    GLOBAL_REPORT_COUNT(120)
    0x81,0x02,                  //22    MAIN_INPUT(data var absolute NoWrap linear PreferredState NoNullPosition NonVolatile )  Input 15.0
    0xC0,                       //24    MAIN_COLLECTION_END

