sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
#ifdef  ENABLE_MAC_FN_REPORT
     0x05, 0x0c,   //# Usage Page (Consumer Devices)
     0x09, 0x01,   //#   Usage (Consumer Control)
     0xa1, 0x01,   //#   Collection (Application)
     0x85, HID_RPT_ID_FN_IN, //  ###~~~~~~~~~~~~~  #   Report ID=0x11
     0x15, 0x00,   //#LOGICAL_MINIMUM(0)
     0x25, 0x01,   //#LOGICAL_MAXIMUM(1)
     0x75, 0x01,   //# REPORT_SIZE(1)
     0x95, 0x03,   //#REPORT_COUNT(3)
     0x81, 0x01,   //#INPUT(Const,Ary,Abs)-------------3bit
     0x75, 0x01,   //#REPORT_SIZE(1)
     0x95, 0x01,   //#REPORT_COUNT(1)
     0x05, 0x0c,   //#USAGE_PAGE(Consumer Devices)
     0x09, 0xb8,   //#USAGE(Eject)
     0x81, 0x02,   //#INPUT(Data,Var,Abs)----------------1bit
     0x06, 0xff, 0x00,   //#USAGE_PAGE(Reserved)
     0x09, 0x03,   //#USAGE(Fn)
     0x81, 0x02,   //#INPUT(Data,Var,Abs)----------------1bit
     0x75, 0x01,   //#REPORT_SIZE(1)
     0x95, 0x03,   //#REPORT_COUNT(3)
     0x81, 0x01,   //#INPUT(Const,Ary,Abs)----------------3bit
     0xc0,
#endif
#ifdef  SMART_WHEEL
     // smart wheel
     0x05, 0x01,        // Usage Page (Generic Desktop Ctrls)
     0x09, 0x0E,        // Usage (0x0E)
     0xA1, 0x01,        // Collection (Application)
     0x85, HID_RPT_ID_SMART_WHEEL_IN,        //   Report ID (8)
     0x05, 0x0D,        //   Usage Page (Digitizer)
     0x09, 0x21,        //   Usage (Puck)
     0xA1, 0x00,        //   Collection (Physical)
     0x05, 0x09,        //     Usage Page (Button)
     0x09, 0x01,        //     Usage (0x01)
     0x95, 0x01,        //     Report Count (1)
     0x75, 0x01,        //     Report Size (1)
     0x15, 0x00,        //     Logical Minimum (0)
     0x25, 0x01,        //     Logical Maximum (1)
     0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
     0x05, 0x01,        //     Usage Page (Generic Desktop Ctrls)
     0x09, 0x37,        //     Usage (Dial)
     0x95, 0x01,        //     Report Count (1)
     0x75, 0x0F,        //     Report Size (15)
     0x55, 0x0F,        //     Unit Exponent (-1)
     0x65, 0x14,        //     Unit (System: English Rotation, Length: Centimeter)
     0x36, 0xF0, 0xF1,  //     Physical Minimum (-3600)
     0x46, 0x10, 0x0E,  //     Physical Maximum (3600)
     0x16, 0xF0, 0xF1,  //     Logical Minimum (-3600)
     0x26, 0x10, 0x0E,  //     Logical Maximum (3600)
     0x81, 0x06,        //     Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
     0x09, 0x30,        //     Usage (X)
     0x75, 0x10,        //     Report Size (16)
     0x55, 0x0D,        //     Unit Exponent (-3)
     0x65, 0x13,        //     Unit (System: English Linear, Length: Centimeter)
     0x35, 0x00,        //     Physical Minimum (0)
     0x46, 0xC0, 0x5D,  //     Physical Maximum (24000)
     0x15, 0x00,        //     Logical Minimum (0)
     0x26, 0xFF, 0x7F,  //     Logical Maximum (32767)
     0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
     0x09, 0x31,        //     Usage (Y)
     0x46, 0xB0, 0x36,  //     Physical Maximum (14000)
     0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
     0x05, 0x0D,        //     Usage Page (Digitizer)
     0x09, 0x48,        //     Usage (0x48)
     0x36, 0xB8, 0x0B,  //     Physical Minimum (3000)
     0x46, 0xB8, 0x0B,  //     Physical Maximum (3000)
     0x16, 0xB8, 0x0B,  //     Logical Minimum (3000)
     0x26, 0xB8, 0x0B,  //     Logical Maximum (3000)
     0x81, 0x03,        //     Input (Const,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
     0xC0,              //   End Collection
     0xC0,              // End Collection
#endif
     // 101 bytes
//    0x06,0xFF,0xFF,             //135   GLOBAL_USAGE_PAGE(Reserved or Other)
//    0x09,0x01,                  //138   LOCAL_USAGE()
//    0xA1,0x01,                  //140   MAIN_COLLECTION(Applicatior)
//        0x85,HID_RPT_ID_OTHER,                  //142   GLOBAL_REPORT_ID(5)
//        0x09,0x01,                  //144   LOCAL_USAGE()
//        0x15,0x00,                  //146   GLOBAL_LOGICAL_MINIMUM(0)
//        0x26,0xFF,0x00,             //148   GLOBAL_LOCAL_MAXIMUM(255/255)
//        0x75,0x08,                  //151   GLOBAL_REPORT_SIZE(8)
//        0x95,0x03,                  //153   GLOBAL_REPORT_COUNT(3)
//        0x81,0x02,                  //155   MAIN_INPUT(data var absolute NoWrap linear PreferredState NoNullPosition NonVolatile )  Input 25.0
//    0xC0,                       //157   MAIN_COLLECTION_END
#endif
};

// HID report map length
uint16_t hidReportMapLen = sizeof(hidReportMap);

// HID report mapping table
static hidRptMap_t hidRptMap[HID_NUM_REPORTS];

/*********************************************************************
 * Profile Attributes - variables
 */

// HID Service attribute
static const gattAttrType_t hidService = {ATT_BT_UUID_SIZE, hidServUUID};

// Include attribute (Battery service)
static uint16_t include = GATT_INVALID_HANDLE;

// HID Information characteristic
static uint8_t hidInfoProps = GATT_PROP_READ;

// HID Report Map characteristic
static uint8_t hidReportMapProps = GATT_PROP_READ;

// HID External Report Reference Descriptor
static uint8_t hidExtReportRefDesc[ATT_BT_UUID_SIZE] =
    {LO_UINT16(BATT_LEVEL_UUID), HI_UINT16(BATT_LEVEL_UUID)};

// HID Control Point characteristic
static uint8_t hidControlPointProps = GATT_PROP_WRITE_NO_RSP;
static uint8_t hidControlPoint;

// HID Protocol Mode characteristic
static uint8_t hidProtocolModeProps = GATT_PROP_READ | GATT_PROP_WRITE_NO_RSP;
uint8_t        hidProtocolMode = HID_PROTOCOL_MODE_REPORT;

// HID Report characteristic, class key input
static uint8_t       hidReportClassKeyInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportClassKeyIn;
static gattCharCfg_t hidReportClassKeyInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, class key input
static uint8_t hidReportRefClassKeyIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_CLASS_KEY_IN, HID_REPORT_TYPE_INPUT};

// HID Report characteristic, LED output
static uint8_t hidReportLedOutProps = GATT_PROP_READ | GATT_PROP_WRITE | GATT_PROP_WRITE_NO_RSP;
static uint8_t hidReportLedOut;

// HID Report Reference characteristic descriptor, LED output
static uint8_t hidReportRefLedOut[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_LED_OUT, HID_REPORT_TYPE_OUTPUT};

#if TOUCH
//声明触摸板特征变量
// HID Report characteristic, Touchpad input
static uint8_t       hidReportTouchpadInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportTouchpadIn;
static gattCharCfg_t hidReportTouchpadInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, Touchpad input
static uint8_t hidReportTouchpadRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_TOUCHPAD_IN, HID_REPORT_TYPE_INPUT};


// 增加一个触控板FEATURE，用于报告表面触点，需要实现GATT 读写模式
// HID Report characteristic, Touchpad Feature
static uint8_t       hidReportTouchpadFeatureProps = GATT_PROP_READ | GATT_PROP_WRITE;
static uint8_t      hidReportTouchpadFeature[2];

static uint8_t       hidReportTouchpadFeatureRef[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_TOUCHPAD_FEATURE, HID_REPORT_TYPE_FEATURE};

#endif

#if MOUSE
// HID Report characteristic, Mouse input
static uint8_t       hidReportMouseInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportMouseIn;
static gattCharCfg_t hidReportMouseInClientCharCfg[GATT_MAX_NUM_CONN];

