sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
// HID Report Reference characteristic descriptor, Mouse input
static uint8_t hidReportRefMouseIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_MOUSE_IN, HID_REPORT_TYPE_INPUT};
#endif

// HID Report characteristic, consumer input
static uint8_t       hidReportConsumerInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportConsumerIn;
static gattCharCfg_t hidReportConsumerInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, consumer input
static uint8_t hidReportRefConsumerIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_CONSUMER_IN, HID_REPORT_TYPE_INPUT};

#if USE_SYS_CTR_HID

// HID Report characteristic, sys_ctl input
static uint8_t       hidReportSysCtlInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportSysCtlIn;
static gattCharCfg_t hidReportSysCtlInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, sys_ctl input
static uint8_t hidReportSysCtlRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_SYS_CTL_IN, HID_REPORT_TYPE_INPUT};
#endif

// HID Report characteristic, ALL_KEY input
static uint8_t       hidReportAllKeyInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportAllKeyIn;
static gattCharCfg_t hidReportAllKeyInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, ALL_KEY input
static uint8_t hidReportAllKeyRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_ALL_KEY_IN, HID_REPORT_TYPE_INPUT};

// HID Report characteristic, Fn input
static uint8_t       hidReportFnInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportFnIn;
static gattCharCfg_t hidReportFnInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, Fn input
static uint8_t hidReportFnRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_FN_IN, HID_REPORT_TYPE_INPUT};

// HID Report characteristic, SmartWheel input
static uint8_t       hidReportSmartWheelInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportSmartWheelIn;
static gattCharCfg_t hidReportSmartWheelInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, SmartWheel input
static uint8_t hidReportSmartWheelRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_SMART_WHEEL_IN, HID_REPORT_TYPE_INPUT};

// HID Boot Keyboard Input Report
static uint8_t       hidReportBootKeyInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportBootKeyIn;
static gattCharCfg_t hidReportBootKeyInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Boot Keyboard Output Report
static uint8_t hidReportBootKeyOutProps = GATT_PROP_READ | GATT_PROP_WRITE | GATT_PROP_WRITE_NO_RSP;
static uint8_t hidReportBootKeyOut;

// Feature Report
static uint8_t hidReportFeatureProps = GATT_PROP_READ | GATT_PROP_WRITE;
static uint8_t hidReportFeature;

// HID Report Reference characteristic descriptor, Feature
static uint8_t hidReportRefFeature[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_FEATURE, HID_REPORT_TYPE_FEATURE};

/*********************************************************************
 * Profile Attributes - Table
 */

static gattAttribute_t hidAttrTbl[] = {
    // HID Service
    {
        {ATT_BT_UUID_SIZE, primaryServiceUUID}, /* type */
        GATT_PERMIT_READ,                       /* permissions */
        0,                                      /* handle */
        (uint8_t *)&hidService                  /* pValue */
    },

    // Included service (battery)
    {
        {ATT_BT_UUID_SIZE, includeUUID},
        GATT_PERMIT_READ,
        0,
        (uint8_t *)&include},

    // HID Information characteristic declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidInfoProps},

    // HID Information characteristic
    {
        {ATT_BT_UUID_SIZE, hidInfoUUID},
        GATT_PERMIT_ENCRYPT_READ,
        0,
        (uint8_t *)hidInfo},

    // HID Control Point characteristic declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidControlPointProps},

    // HID Control Point characteristic
    {
        {ATT_BT_UUID_SIZE, hidControlPointUUID},
        GATT_PERMIT_ENCRYPT_WRITE,
        0,
        &hidControlPoint},

    // HID Protocol Mode characteristic declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidProtocolModeProps},

    // HID Protocol Mode characteristic
    {
        {ATT_BT_UUID_SIZE, hidProtocolModeUUID},
        GATT_PERMIT_ENCRYPT_READ | GATT_PERMIT_ENCRYPT_WRITE,
        0,
        &hidProtocolMode},

    // HID Report Map characteristic declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportMapProps},

    // HID Report Map characteristic
    {
        {ATT_BT_UUID_SIZE, hidReportMapUUID},
        GATT_PERMIT_ENCRYPT_READ,
        0,
        (uint8_t *)hidReportMap},

    // HID External Report Reference Descriptor
    {
        {ATT_BT_UUID_SIZE, extReportRefUUID},
        GATT_PERMIT_READ,
        0,
        hidExtReportRefDesc},

#if USE_SYS_CTR_HID

    // HID Report characteristic, sys_ctl input declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportSysCtlInProps},

        // HID Report characteristic, sys_ctl input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportSysCtlIn},

        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportSysCtlInClientCharCfg},

        // HID Report Reference characteristic descriptor, sys_ctl input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportSysCtlRefIn},
#endif

    // HID Report characteristic, class key input declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportClassKeyInProps},

        // HID Report characteristic, class key input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportClassKeyIn},

