sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportClassKeyInClientCharCfg},

        // HID Report Reference characteristic descriptor, class key input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportRefClassKeyIn},

    // HID Report characteristic, LED output declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportLedOutProps},

        // HID Report characteristic, LED output
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            &hidReportLedOut},

        // HID Report Reference characteristic descriptor, LED output
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportRefLedOut},

#if TOUCH
    // HID Report characteristic, Touchpad input declaration 添加GATT属性表
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportTouchpadInProps},

        // HID Report characteristic, Touchpad input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},  // 使用相同的UUID (0x2A4D)
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportTouchpadIn},

        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportTouchpadInClientCharCfg},

        // HID Report Reference characteristic descriptor, Touchpad input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportTouchpadRefIn},

    // HID Report characteristic, Touchpad Feature declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportTouchpadFeatureProps},

        // HID Report characteristic, Touchpad Feature
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            hidReportTouchpadFeature},//去掉&

        // HID Report Reference characteristic descriptor, Touchpad Feature
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportTouchpadFeatureRef},
#endif
#if MOUSE
    // HID Report characteristic, Mouse input declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportMouseInProps},

        // HID Report characteristic, Mouse input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportMouseIn},

        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportMouseInClientCharCfg},

        // HID Report Reference characteristic descriptor, Mouse input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportRefMouseIn},
#endif
    // HID Report characteristic, consumer input declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportConsumerInProps},

        // HID Report characteristic, consumer input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportConsumerIn},

        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportConsumerInClientCharCfg},

        // HID Report Reference characteristic descriptor, consumer input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportRefConsumerIn},

    // HID Report characteristic, ALL_KEY input declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportAllKeyInProps},

        // HID Report characteristic, ALL_KEY input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportAllKeyIn},

        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportAllKeyInClientCharCfg},

        // HID Report Reference characteristic descriptor, ALL_KEY input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportAllKeyRefIn},

    // HID Report characteristic, Fn input declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportFnInProps},

        // HID Report characteristic, Fn input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportFnIn},

        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportFnInClientCharCfg},

        // HID Report Reference characteristic descriptor, Fn input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportFnRefIn},

