sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
// Service Callbacks
gattServiceCBs_t hidKbdCBs = {
    HidDev_ReadAttrCB,  // Read callback function pointer
    HidDev_WriteAttrCB, // Write callback function pointer
    NULL                // Authorization callback function pointer
};

/*********************************************************************
 * PUBLIC FUNCTIONS
 */

/*********************************************************************
 * @fn      Hid_AddService
 *
 * @brief   Initializes the HID Service by registering
 *          GATT attributes with the GATT server.
 *
 * @return  Success or Failure
 */
bStatus_t Hid_AddService(void)//HID Over GATT Profile 
{
    uint8_t status = SUCCESS;

    // Initialize Client Characteristic Configuration attributes
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportClassKeyInClientCharCfg);
#if TOUCH
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportTouchpadInClientCharCfg);//初始化cccd使能notify
#endif
#if MOUSE
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportMouseInClientCharCfg);
#endif
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportConsumerInClientCharCfg);
#if USE_SYS_CTR_HID
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportSysCtlInClientCharCfg);
#endif
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportAllKeyInClientCharCfg);
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportFnInClientCharCfg);
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportSmartWheelInClientCharCfg);
    GATTServApp_InitCharCfg(INVALID_CONNHANDLE, hidReportBootKeyInClientCharCfg);

    // Register GATT attribute list and CBs with GATT Server App
    status = GATTServApp_RegisterService(hidAttrTbl, GATT_NUM_ATTRS(hidAttrTbl), GATT_MAX_ENCRYPT_KEY_SIZE, &hidKbdCBs);

    // Set up included service
    Batt_GetParameter(BATT_PARAM_SERVICE_HANDLE,
                      &GATT_INCLUDED_HANDLE(hidAttrTbl, HID_INCLUDED_SERVICE_IDX));

    // Construct map of reports to characteristic handles
    // Each report is uniquely identified via its ID and type

    // Class Key input report
    hidRptMap[0].id = hidReportRefClassKeyIn[0];
    hidRptMap[0].type = hidReportRefClassKeyIn[1];
    hidRptMap[0].handle = hidAttrTbl[HID_REPORT_CLASS_KEY_IN_IDX].handle;
    hidRptMap[0].cccdHandle = hidAttrTbl[HID_REPORT_CLASS_KEY_IN_CCCD_IDX].handle;
    hidRptMap[0].mode = HID_PROTOCOL_MODE_REPORT;
//    PRINT("%x \n",hidRptMap[0].cccdHandle);

    // LED output report
    hidRptMap[1].id = hidReportRefLedOut[0];
    hidRptMap[1].type = hidReportRefLedOut[1];
    hidRptMap[1].handle = hidAttrTbl[HID_REPORT_LED_OUT_IDX].handle;
    hidRptMap[1].cccdHandle = 0;
    hidRptMap[1].mode = HID_PROTOCOL_MODE_REPORT;
#if TOUCH
    // Touchpad input report 映射表
    hidRptMap[2].id = hidReportTouchpadRefIn[0];
    hidRptMap[2].type = hidReportTouchpadRefIn[1];
    hidRptMap[2].handle = hidAttrTbl[HID_REPORT_TOUCHPAD_IN_IDX].handle;
    hidRptMap[2].cccdHandle = hidAttrTbl[HID_REPORT_TOUCHPAD_IN_CCCD_IDX].handle;
    hidRptMap[2].mode = HID_PROTOCOL_MODE_REPORT;

    // Touchpad Feature report
    hidRptMap[3].id = hidReportTouchpadFeatureRef[0];
    hidRptMap[3].type = hidReportTouchpadFeatureRef[1];
    hidRptMap[3].handle = hidAttrTbl[HID_TOUCHPAD_FEATURE_IDX].handle;
    hidRptMap[3].cccdHandle = 0;
    hidRptMap[3].mode = HID_PROTOCOL_MODE_REPORT;
#endif
#if MOUSE
    // Mouse input report
    hidRptMap[12].id = hidReportRefMouseIn[0];
    hidRptMap[12].type = hidReportRefMouseIn[1];
    hidRptMap[12].handle = hidAttrTbl[HID_REPORT_MOUSE_IN_IDX].handle;
    hidRptMap[12].cccdHandle = hidAttrTbl[HID_REPORT_MOUSE_IN_CCCD_IDX].handle;
    hidRptMap[12].mode = HID_PROTOCOL_MODE_REPORT;
//    PRINT("%x \n",hidRptMap[0].cccdHandle);
#endif
    // consumer input report
    hidRptMap[4].id = hidReportRefConsumerIn[0];
    hidRptMap[4].type = hidReportRefConsumerIn[1];
    hidRptMap[4].handle = hidAttrTbl[HID_REPORT_CONSUMER_IN_IDX].handle;
    hidRptMap[4].cccdHandle = hidAttrTbl[HID_REPORT_CONSUMER_IN_CCCD_IDX].handle;
    hidRptMap[4].mode = HID_PROTOCOL_MODE_REPORT;
//    PRINT("%x \n",hidRptMap[3].cccdHandle);

#if USE_SYS_CTR_HID
    // sys_ctl input report
    hidRptMap[5].id = hidReportSysCtlRefIn[0];
    hidRptMap[5].type = hidReportSysCtlRefIn[1];
    hidRptMap[5].handle = hidAttrTbl[HID_REPORT_SYS_CTL_IN_IDX].handle;
    hidRptMap[5].cccdHandle = hidAttrTbl[HID_REPORT_SYS_CTL_IN_CCCD_IDX].handle;
    hidRptMap[5].mode = HID_PROTOCOL_MODE_REPORT;
//    PRINT("%x \n",hidRptMap[4].cccdHandle);
#endif

    // ALL_KEY input report
    hidRptMap[6].id = hidReportAllKeyRefIn[0];
    hidRptMap[6].type = hidReportAllKeyRefIn[1];
    hidRptMap[6].handle = hidAttrTbl[HID_REPORT_ALL_KEY_IN_IDX].handle;
    hidRptMap[6].cccdHandle = hidAttrTbl[HID_REPORT_ALL_KEY_IN_CCCD_IDX].handle;
    hidRptMap[6].mode = HID_PROTOCOL_MODE_REPORT;
//    PRINT("%x \n",hidRptMap[5].cccdHandle);

    // FN input report
    hidRptMap[7].id = hidReportFnRefIn[0];
    hidRptMap[7].type = hidReportFnRefIn[1];
    hidRptMap[7].handle = hidAttrTbl[HID_REPORT_FN_IN_IDX].handle;
    hidRptMap[7].cccdHandle = hidAttrTbl[HID_REPORT_FN_IN_CCCD_IDX].handle;
    hidRptMap[7].mode = HID_PROTOCOL_MODE_REPORT;
//    PRINT("%x \n",hidRptMap[7].cccdHandle);

    // SMART_WHEEL input report
    hidRptMap[8].id = hidReportSmartWheelRefIn[0];
    hidRptMap[8].type = hidReportSmartWheelRefIn[1];
    hidRptMap[8].handle = hidAttrTbl[HID_REPORT_SMART_WHEEL_IN_IDX].handle;
    hidRptMap[8].cccdHandle = hidAttrTbl[HID_REPORT_SMART_WHEEL_IN_CCCD_IDX].handle;
    hidRptMap[8].mode = HID_PROTOCOL_MODE_REPORT;
//    PRINT("%x \n",hidRptMap[6].cccdHandle);

    // Boot keyboard input report
    // Use same ID and type as key input report
    hidRptMap[9].id = hidReportRefClassKeyIn[0];
    hidRptMap[9].type = hidReportRefClassKeyIn[1];
    hidRptMap[9].handle = hidAttrTbl[HID_BOOT_KEY_IN_IDX].handle;
    hidRptMap[9].cccdHandle = hidAttrTbl[HID_BOOT_KEY_IN_CCCD_IDX].handle;
    hidRptMap[9].mode = HID_PROTOCOL_MODE_BOOT;
//    PRINT("%x \n",hidRptMap[7].cccdHandle);

    // Boot keyboard output report
    // Use same ID and type as LED output report
    hidRptMap[10].id = hidReportRefLedOut[0];
    hidRptMap[10].type = hidReportRefLedOut[1];
    hidRptMap[10].handle = hidAttrTbl[HID_BOOT_KEY_OUT_IDX].handle;
    hidRptMap[10].cccdHandle = 0;
    hidRptMap[10].mode = HID_PROTOCOL_MODE_BOOT;

